crathje/ESP32_A1S_Radio/src/main.cpp
#ifdef DAC2USE_AC101
// I2S GPIOs, the names refer on AC101, AS1 Audio Kit V2.2 2379
#define I2S_DSIN 35 // pin not used
#define I2S_BCLK 27
#define I2S_LRC 26
#define I2S_MCLK 0
#define I2S_DOUT 25
#endif

#ifdef DAC2USE_ES8388
// I2S GPIOs, the names refer on ES8388, AS1 Audio Kit V2.2 3378
#define I2S_DSIN 35 // pin not used
#define I2S_BCLK 27
#define I2S_LRC 25
#define I2S_MCLK 0
#define I2S_DOUT 26
#endif

// I2C GPIOs
#define IIC_CLK 32
#define IIC_DATA 33

// buttons
// #define BUTTON_2_PIN 13             // shared with SPI_CS
#define BUTTON_3_PIN 19
// #define BUTTON_4_PIN 23
// #define BUTTON_5_PIN 18 // Stop
// #define BUTTON_6_PIN 5  // Play

#define IIC_EXTERNAL_CLK 5
#define IIC_EXTERNAL_DATA 18
#define IIC_EXTERNAL_DATA_FREQ 400000

// amplifier enable
#define GPIO_PA_EN 21

#define ROTARY_ENCODER_A_CLK_PIN 22
#define ROTARY_ENCODER_B_DT_PIN 19
#define ROTARY_ENCODER_BUTTON_PIN -1
#define ROTARY_ENCODER_STEPS 2
ESP32Encoder rotaryEncoder;

// Switch S1: 1-OFF, 2-ON, 3-ON, 4-ON, 5-ON

#ifdef DAC2USE_AC101
static AC101 dac; // AC101
#endif

#ifdef DAC2USE_ES8388
static ES8388 dac; // ES8388 (new board)
#endif
int volume = 70; // 0...100

Audio audio;

// #ifdef U8X8_HAVE_HW_SPI
// #include <SPI.h>
// #endif
// #ifdef U8X8_HAVE_HW_I2C
// #include <Wire.h>
// #endif/
// U8G2_SSD1306_128X32_UNIVISION_1_2ND_HW_I2C u8g2(U8G2_R0 /* rotation */, /* reset=*/U8X8_PIN_NONE, IIC_EXTERNAL_DATA, IIC_EXTERNAL_CLK);
// U8G2_SH1106_128X64_NONAME_F_2ND_HW_I2C u8g2(U8G2_R0, U8X8_PIN_NONE, 4, 5);

#define SCREEN_WIDTH 128
#define SCREEN_HEIGHT 32

Adafruit_SSD1306 display(SCREEN_WIDTH, SCREEN_HEIGHT, &I2C_2, -1);
volatile boolean foundDisplay = false;

// #####################################################################

void drawDisplay()
{
  if (foundDisplay)
  {
    display.clearDisplay();
    display.setTextColor(WHITE);
    display.setTextSize(1);
    display.setCursor(0, 0);
    String lastPlayedStationS = String(lastPlayedStation);
    display.println(lastPlayedStationS.substring(0, 20).c_str());
    display.println(lastPlayedStreamTitle);

    int mapped = map(volume, 0, 100, 0, SCREEN_WIDTH);
    for (int y = SCREEN_HEIGHT - 3; y < SCREEN_HEIGHT; y++)
    {
      display.drawLine(0, y, mapped, y, WHITE);
    }

    display.display();
  }
}

void onWebSocketEvent(AsyncWebSocket *server, AsyncWebSocketClient *client, AwsEventType type,
                      void *arg, uint8_t *data, size_t len)
{
  switch (type)
  {
  case WS_EVT_CONNECT:
    // Serial.printf("WebSocket client #%u connected from %s\n", client->id(), client->remoteIP().toString().c_str());
    client->text("C\t" + String(lastPlayedUrl));
    client->text("ASTT\t" + String(lastPlayedStreamTitle));
    client->text("ASTA\t" + String(lastPlayedStation));
    client->text("V\t" + String(volume));
    break;
  case WS_EVT_DISCONNECT:
    // Serial.printf("WebSocket client #%u disconnected\n", client->id());
    break;
  case WS_EVT_DATA:
    // handleWebSocketMessage(arg, data, len);
    break;
  case WS_EVT_PONG:
  case WS_EVT_ERROR:
    break;
  }
}

void setVolume(int value)
{
  // Serial.printf("Volume set to: %d\r\n", value);
  if (value > 100)
  {
    value = 100;
  }
  if (value < 0)
  {
    value = 0;
  }

  volume = value;
#ifdef DAC2USE_ES8388
  dac.volume(ES8388::ES_MAIN, value);
  dac.volume(ES8388::ES_OUT1, value);
  dac.volume(ES8388::ES_OUT2, value);
  dac.mute(ES8388::ES_OUT1, false);
  dac.mute(ES8388::ES_OUT2, false);
  dac.mute(ES8388::ES_MAIN, false);
#endif

#ifdef DAC2USE_AC101
  dac.setVolumeSpeaker(value);
  dac.setVolumeHeadphone(value);
#endif

  asyncWebSocket.textAll("V\t" + String(volume));
  drawDisplay();
}

void actionPlayPause() { audio.pauseResume(); }
void actionVolumeUp() { setVolume(volume + 1); }
void actionVolumeDown() { setVolume(volume - 1); }

void actionUpdateStarting()
{
  digitalWrite(GPIO_PA_EN, LOW);
// mute!
#ifdef DAC2USE_ES8388
  dac.mute(ES8388::ES_OUT1, true);
  dac.mute(ES8388::ES_OUT2, true);
  dac.mute(ES8388::ES_MAIN, true);
#endif
  audio.stopSong();

  if (foundDisplay)
  {
    display.clearDisplay();
    display.setTextColor(WHITE);
    display.setTextSize(2);
    display.setCursor(0, 0);
    display.println("Updating...");
    display.display();
  }
}

void buttonClick(Button2 &btn)
{
  if (btn == button4)
  {
  }
  // else if (btn == button5)
  // {
  //   actionPlayPause();
  // }
  // else if (btn == button6)
  // {
  //   actionVolumeUp();
  // }
}

void playUrl(const char *url)
{
  audio_showstreamtitle("");

  String surl = String(url);
  sprintf(lastPlayedStation, "%s", surl.substring(surl.lastIndexOf("/") + 1).c_str());
  audio_showstation(lastPlayedStation);
  strcpy(lastPlayedUrl, url);
  asyncWebSocket.textAll("C\t" + String(url));
  audio.connecttohost(url);
}

void setup()
{
  Serial.begin(115200);
  Serial.println("\r\nReset");

  uint64_t chipid = ESP.getEfuseMac(); // The chip ID is essentially its MAC
                                       // address(length: 6 bytes).
  Serial.println(F("===== CHIP INFO ====="));
  Serial.printf_P(PSTR("ChipID:            %04X%08X\r\n"),
                  (uint16_t)(chipid >> 32), (uint32_t)chipid);
  Serial.printf_P(PSTR("ChipCores:         %d\r\n"), ESP.getChipCores());
  Serial.printf_P(PSTR("CpuFreqMHz:        %3d\r\n"), ESP.getCpuFreqMHz());
  Serial.printf_P(PSTR("ChipRevision:      %d\r\n"), ESP.getChipRevision());
  Serial.printf_P(PSTR("FreeHeap:          %3d\r\n"), ESP.getFreeHeap());
  Serial.printf_P(PSTR("CycleCount:        %3d\r\n"), ESP.getCycleCount());
  Serial.printf_P(PSTR("SdkVersion:        %s\r\n"), ESP.getSdkVersion());
  Serial.printf_P(PSTR("FlashChipSize:     %3d\r\n"), ESP.getFlashChipSize());
  // DebugHWSerial.printf("FlashChipRealSize: %3d\n"),
  // ESP.getFlashChipRealSize());
  Serial.printf_P(PSTR("FlashChipSpeed:    %3d\r\n"), ESP.getFlashChipSpeed());
  Serial.printf_P(PSTR("FlashChipMode:     %d\r\n"), ESP.getFlashChipMode());
  Serial.printf_P(PSTR("SketchSize:        %d\r\n"), ESP.getSketchSize());
  Serial.printf_P(PSTR("FreeSketchSpace:   %d\r\n"), ESP.getFreeSketchSpace());
  Serial.printf_P(PSTR("ArduinoStack:      %d\r\n"),
                  getArduinoLoopTaskStackSize());
  Serial.printf_P(PSTR("ArduinoVersion:    %d.%d.%d\r\n"),
                  ESP_ARDUINO_VERSION_MAJOR, ESP_ARDUINO_VERSION_MINOR,
                  ESP_ARDUINO_VERSION_PATCH);

  // pinMode(BUTTON_3_PIN, INPUT_PULLUP);
  // pinMode(BUTTON_4_PIN, INPUT_PULLUP);
  // pinMode(BUTTON_5_PIN, INPUT_PULLUP);
  // pinMode(BUTTON_6_PIN, INPUT_PULLUP);

