crathje/ESP32_A1S_Radio/src/main.cpp
  // button3.begin(BUTTON_3_PIN);
  // button3.setClickHandler(buttonClick);
  // button4.begin(BUTTON_4_PIN);
  // button4.setClickHandler(buttonClick);
  // button5.begin(BUTTON_5_PIN);
  // button5.setClickHandler(buttonClick);
  // button6.begin(BUTTON_6_PIN);
  // button6.setClickHandler(buttonClick);

  pinMode(SD_CS, OUTPUT);
  digitalWrite(SD_CS, HIGH);
  SPI.begin(SPI_SCK, SPI_MISO, SPI_MOSI);
  SPI.setFrequency(1000000);

  Serial.println(F("===== SD CARD INFO ====="));
  if (SD.begin(SD_CS))
  {
    Serial.printf_P(PSTR("cardType:   %d\r\n"), SD.cardType());
    Serial.printf_P(PSTR("cardSize:   %lld\r\n"), SD.cardSize());
    Serial.printf_P(PSTR("totalBytes: %lld\r\n"), SD.totalBytes());
    Serial.printf_P(PSTR("usedBytes:  %lld\r\n"), SD.usedBytes());
  }
  else
  {
    Serial.println(F("SD Init failed."));
  }

  AsyncWiFiManager wifiManager(&asyncWebServer, &dnsServer);
  sprintf(hostname, "A1S-Radio-%04X%08X", (uint16_t)(chipid >> 32),
          (uint32_t)chipid);
  WiFi.setHostname(hostname);
  wifiManager.autoConnect(hostname, NULL);

  DefaultHeaders::Instance().addHeader("Access-Control-Allow-Headers", "*");
  DefaultHeaders::Instance().addHeader("Access-Control-Allow-Origin", "*");
  DefaultHeaders::Instance().addHeader("Access-Control-Allow-Methods", "GET, POST, PUT");
  DefaultHeaders::Instance().addHeader("Access-Control-Allow-Headers", "Content-Type");

  asyncWebServer.on("/", HTTP_GET, [](AsyncWebServerRequest *request)
                    { request->send_P(200, "text/html", index_html); });
  asyncWebServer.on("/stations", HTTP_GET, [](AsyncWebServerRequest *request)
                    { request->send_P(200, "text/plain", stations); });
  asyncWebServer.on("/playpause", HTTP_GET, [](AsyncWebServerRequest *request)
                    {
    request->send(200, "text/plain", "OK");
    actionPlayPause(); });
  asyncWebServer.on("/playurl", HTTP_GET, [](AsyncWebServerRequest *request)
                    {
    if (request->hasParam("playurl")) {
      String url = request->getParam("playurl")->value();
      playUrl(url.c_str());
      request->send(200, "text/plain", "OK");
      return;
    }
    request->send(200, "text/plain", "FAILED"); });
  asyncWebServer.on("/volup", HTTP_GET, [](AsyncWebServerRequest *request)
                    {
    request->send(200, "text/plain", "OK");
    actionVolumeUp(); });
  asyncWebServer.on("/voldown", HTTP_GET, [](AsyncWebServerRequest *request)
                    {
    request->send(200, "text/plain", "OK");
    actionVolumeDown(); });

  asyncWebServer.on("/data.json", HTTP_GET, [](AsyncWebServerRequest *request)
                    { request->send(200, "application/json", String()                                                                   //
                                                                 + F("{")                                                               //
                                                                 + F("\n  \"lastPlayedUrl\": \"") + String(lastPlayedUrl) + F("\"")     //
                                                                 + F("\n, \"rssi\": \"") + String(WiFi.RSSI()) + F("\"")                //
                                                                 + F("\n, \"hostname\": \"") + String(WiFi.getHostname()) + F("\"")     //
                                                                 + F("\n, \"SSID\": \"") + String(WiFi.SSID()) + F("\"")                //
                                                                 + F("\n, \"compile_date\": \"") + String(compile_date) + F("\"")       //
                                                                 + F("\n, \"sdk_version\": \"") + String(ESP.getSdkVersion()) + F("\"") //
                                                                 + F("\n, \"PIO_ENV\": \"") + String(PIO_ENV) + F("\"") + F("\n}")); });

  asyncWebSocket.onEvent(onWebSocketEvent);
  asyncWebServer.addHandler(&asyncWebSocket);

  asyncWebServer.begin();

  Serial.printf_P(PSTR("Connected\r\nRSSI: "));
  Serial.print(WiFi.RSSI());
  Serial.print(" IP: ");
  Serial.print(WiFi.localIP());
  Serial.print(" Hostname: ");
  Serial.println(WiFi.getHostname());

  ElegantOTA.begin(&asyncWebServer); // Start ElegantOTA
  ElegantOTA.onStart(actionUpdateStarting);

  ArduinoOTA
      .onStart([]()
               {
        actionUpdateStarting();

        String type;
        if (ArduinoOTA.getCommand() == U_FLASH)
          type = "sketch";
        else  // U_SPIFFS
          type = "filesystem";

        // NOTE: if updating SPIFFS this would be the place to unmount SPIFFS
        // using SPIFFS.end()
        Serial.println("Start updating " + type); })
      .onError([](ota_error_t error)
               {
        Serial.printf("Error[%u]: ", error);
        if (error == OTA_AUTH_ERROR)
          Serial.println("Auth Failed");
        else if (error == OTA_BEGIN_ERROR)
          Serial.println("Begin Failed");
        else if (error == OTA_CONNECT_ERROR)
          Serial.println("Connect Failed");
        else if (error == OTA_RECEIVE_ERROR)
          Serial.println("Receive Failed");
        else if (error == OTA_END_ERROR)
          Serial.println("End Failed"); });

  ArduinoOTA.setHostname(wifiManager.getConfiguredSTASSID().c_str());
  //  ArduinoOTA.setPassword("secretPass");
  ArduinoOTA.begin();

  Serial.printf("Connect to DAC codec... ");
  while (not dac.begin(IIC_DATA, IIC_CLK))
  {
    Serial.printf("Failed!\n");
    delay(1000);
  }
  Serial.printf("OK\r\n");

  Serial.printf("Starting 2nd I2C on data: %d clk: %d...", IIC_EXTERNAL_DATA, IIC_EXTERNAL_CLK);
  I2C_2.begin(IIC_EXTERNAL_DATA, IIC_EXTERNAL_CLK, IIC_EXTERNAL_DATA_FREQ);
  Serial.printf("OK\r\n");

  Serial.println();
  Serial.println("I2C scanner. Scanning ...");
  byte count = 0;

#define MIN_I2C_DEVICE_ADDR 8
#define MAX_I2C_DEVICE_ADDR 120
  for (byte i = MIN_I2C_DEVICE_ADDR; i < MAX_I2C_DEVICE_ADDR; i++)
  {
    I2C_2.beginTransmission(i);
    if (I2C_2.endTransmission() == 0)
    {
      Serial.printf("Found 0x%02x\r\n", i);
      if (i == SSD1306_ADDRESS)
      {
        foundDisplay = true;
      }
    }
    else
    {
      // Serial.printf("Absent 0x%02x", i);
    }
  }
  Serial.printf("DONE\r\n");

  if (foundDisplay)
  {
    Serial.printf("SSD1306 display init (0x%02x)...", SSD1306_ADDRESS);
    // fonts see https://github.com/olikraus/u8g2/wiki/fntlist8
    // if (u8g2.begin())
    // {
    //   Serial.println(F("OK"));
    //   u8g2.setPowerSave(0);
    //   u8g2.clearBuffer();
    //   u8g2.setFont(u8g2_font_ncenB08_tr);
    //   u8g2.drawStr(0, 10, "Booting...");
    //   u8g2.setFont(u8g2_font_squeezed_r7_tr);
    //   u8g2.drawStr(0, 20, compile_date);
    //   u8g2.sendBuffer();
    //   u8g2.setFont(u8g2_font_ncenB08_tr);
    // }
    // else
    // {
    //   Serial.println(F("FAILED"));
    // }
    display.begin(SSD1306_SWITCHCAPVCC, SSD1306_ADDRESS);
    display.clearDisplay();
    display.display();

