crathje/ESP32_A1S_Radio/src/main.cpp
    display.setTextColor(WHITE);
    display.setTextSize(1);
    display.setCursor(10, 0);
    display.println("Booting...");
    display.display();
  }
  setVolume(volume);

  //  ac.DumpRegisters();

  // Enable amplifier
  pinMode(GPIO_PA_EN, OUTPUT);
  digitalWrite(GPIO_PA_EN, HIGH);

  audio.setPinout(I2S_BCLK, I2S_LRC, I2S_DOUT, I2S_MCLK);
  audio.setVolume(10); // 0...21

  // audio.connecttoFS(SD, "/320k_test.mp3");
  // audio.connecttoSD("/Banana Boat Song - Harry Belafonte.mp3");
  // audio.connecttohost("http://s1-webradio.antenne.de/oldie-antenne");
  // audio.connecttohost("https://live-bauerno.sharp-stream.com/radiorock_no_mp3?direct=true");
  // audio.connecttohost("http://dg-rbb-http-dus-dtag-cdn.cast.addradio.de/rbb/antennebrandenburg/live/mp3/128/stream.mp3");
  // audio.connecttospeech("Wenn die Hunde schlafen, kann der Wolf gut Schafe stehlen.", "de");

  if (ROTARY_ENCODER_A_CLK_PIN != -1 && ROTARY_ENCODER_A_CLK_PIN != -1)
  {
    rotaryEncoder.attachHalfQuad(ROTARY_ENCODER_B_DT_PIN, ROTARY_ENCODER_A_CLK_PIN);
    rotaryEncoder.setCount(0);
  }

  memset(lastPlayedUrl, sizeof(lastPlayedUrl), 0);
  memset(lastPlayedStreamTitle, sizeof(lastPlayedStreamTitle), 0);

  playUrl("http://live-bauerno.sharp-stream.com/radiorock_no_mp3?direct=true");
}

//-----------------------------------------------------------------------

void loop()
{
  audio.loop();
  // button3.loop();
  // button4.loop();
  // button5.loop();
  // button6.loop();
  ArduinoOTA.handle();
  ElegantOTA.loop();

  if (ROTARY_ENCODER_A_CLK_PIN != -1 && ROTARY_ENCODER_A_CLK_PIN != -1)
  {
    int64_t val = rotaryEncoder.getCount();
    if (val)
    {
      // Serial.printf("encoder: %ld\r\n", val);
      rotaryEncoder.clearCount();
      setVolume(volume + val);
    }
  }
}

// optional
void audio_info(const char *info)
{
  Serial.print("info        ");
  Serial.println(info);

  String infoStr(info);
  infoStr.toLowerCase();
  if (infoStr.startsWith("streamurl="))
  {
    asyncWebSocket.textAll("AINF\t" + String(info));
  }
}
void audio_id3data(const char *info)
{ // id3 metadata
  Serial.print("id3data     ");
  Serial.println(info);

  asyncWebSocket.textAll("AID3\t" + String(info));
}
void audio_eof_mp3(const char *info)
{ // end of file
  Serial.print("eof_mp3     ");
  Serial.println(info);

  asyncWebSocket.textAll("AEM3\t" + String(info));
}
void audio_showstation(const char *info)
{
  Serial.print("station     ");
  Serial.println(info);
  strncpy(lastPlayedStation, info, sizeof(lastPlayedStation));
  asyncWebSocket.textAll("ASTA\t" + String(lastPlayedStation));

  drawDisplay();
}
void audio_showstreamtitle(const char *info)
{
  Serial.print("streamtitle ");
  Serial.println(info);
  strncpy(lastPlayedStreamTitle, info, sizeof(lastPlayedStreamTitle));
  asyncWebSocket.textAll("ASTT\t" + String(lastPlayedStreamTitle));

  drawDisplay();
}
void audio_bitrate(const char *info)
{
  Serial.print("bitrate     ");
  Serial.println(info);
}
void audio_commercial(const char *info)
{ // duration in sec
  Serial.print("commercial  ");
  Serial.println(info);
}
void audio_icyurl(const char *info)
{ // homepage
  Serial.print("icyurl      ");
  Serial.println(info);
}
void audio_lasthost(const char *info)
{ // stream URL played
  Serial.print("lasthost    ");
  Serial.println(info);
}
void audio_eof_speech(const char *info)
{
  Serial.print("eof_speech  ");
  Serial.println(info);
}